In [30]:
import pandas as pd

In [31]:
people = {
    "first" : ["Sutton" , "Kat" , "Jane"] ,
     "last" : ["Brady" , "Edison" , "Sloan"] ,
     "email" : ["sutton@gmail.com" , "kat@gmail.com" , "jane@gmail.com"],
     "workplace" : ["Scarlet" , "Scarlet" , "Incite"]
}

In [32]:
df = pd.DataFrame(people)

In [33]:
df

    first    last             email workplace
0  Sutton   Brady  sutton@gmail.com   Scarlet
1     Kat  Edison     kat@gmail.com   Scarlet
2    Jane   Sloan    jane@gmail.com    Incite

## Add columns

In [34]:
df['full_name'] = df['first'] + '' + df['last']
df

    first    last             email workplace    full_name
0  Sutton   Brady  sutton@gmail.com   Scarlet  SuttonBrady
1     Kat  Edison     kat@gmail.com   Scarlet    KatEdison
2    Jane   Sloan    jane@gmail.com    Incite    JaneSloan

In [35]:
df

    first    last             email workplace    full_name
0  Sutton   Brady  sutton@gmail.com   Scarlet  SuttonBrady
1     Kat  Edison     kat@gmail.com   Scarlet    KatEdison
2    Jane   Sloan    jane@gmail.com    Incite    JaneSloan

## Drop Columns

In [36]:
df.drop(columns = 'full_name' , inplace = True)

In [37]:
df

    first    last             email workplace
0  Sutton   Brady  sutton@gmail.com   Scarlet
1     Kat  Edison     kat@gmail.com   Scarlet
2    Jane   Sloan    jane@gmail.com    Incite

#### Add and separate a column using string methods

In [38]:
df['Full Name'] = df['first'] + ' ' + df['last']
df

    first    last             email workplace     Full Name
0  Sutton   Brady  sutton@gmail.com   Scarlet  Sutton Brady
1     Kat  Edison     kat@gmail.com   Scarlet    Kat Edison
2    Jane   Sloan    jane@gmail.com    Incite    Jane Sloan

In [39]:
df[['first_split' , 'last_split']] = df['Full Name'].str.split(' ' , expand = True)
df

,first,last,email,workplace,Full Name,first_split,last_split
0,Sutton,Brady,sutton@gmail.com,Scarlet,Sutton Brady,Sutton,Brady
1,Kat,Edison,kat@gmail.com,Scarlet,Kat Edison,Kat,Edison
2,Jane,Sloan,jane@gmail.com,Incite,Jane Sloan,Jane,Sloan

In [40]:
df.drop(columns = ['first_split' , 'last_split'] , inplace = True)
df

    first    last             email workplace     Full Name
0  Sutton   Brady  sutton@gmail.com   Scarlet  Sutton Brady
1     Kat  Edison     kat@gmail.com   Scarlet    Kat Edison
2    Jane   Sloan    jane@gmail.com    Incite    Jane Sloan

### Adding a single row of data
Append

In [44]:
df.append({'first' : 'Adena'} , ignore_index  = True)
#Ignore index helps to add data only to the specific cols

    first    last             email workplace     Full Name
0  Sutton   Brady  sutton@gmail.com   Scarlet  Sutton Brady
1     Kat  Edison     kat@gmail.com   Scarlet    Kat Edison
2    Jane   Sloan    jane@gmail.com    Incite    Jane Sloan
3   Adena     NaN               NaN       NaN           NaN

In [46]:
people = {
    'first' : ['Richard' , 'Ryan'],
     'last' : ['Hunter' , 'Pinstripe'],
     'email' : ['RichardHunter@gmail.com' , 'Pinstripe@gmail.com'],
     'workplace' : ['Stafford' , 'Pinstripe']
}

In [47]:
df2 = pd.DataFrame(people)

In [48]:
df = df.append(df2 , ignore_index = True)

In [49]:
df

     first       last                    email  workplace     Full Name
0   Sutton      Brady         sutton@gmail.com    Scarlet  Sutton Brady
1      Kat     Edison            kat@gmail.com    Scarlet    Kat Edison
2     Jane      Sloan           jane@gmail.com     Incite    Jane Sloan
3  Richard     Hunter  RichardHunter@gmail.com   Stafford           NaN
4     Ryan  Pinstripe      Pinstripe@gmail.com  Pinstripe           NaN

In [50]:
df.drop(index = 4)

     first    last                    email workplace     Full Name
0   Sutton   Brady         sutton@gmail.com   Scarlet  Sutton Brady
1      Kat  Edison            kat@gmail.com   Scarlet    Kat Edison
2     Jane   Sloan           jane@gmail.com    Incite    Jane Sloan
3  Richard  Hunter  RichardHunter@gmail.com  Stafford           NaN

### Dropping rows based on a condition

In [56]:
filt = (df['workplace'] == 'Scarlet') | (df['workplace'] == 'Incite')
df.drop(index = df[~filt].index)

    first    last             email workplace     Full Name
0  Sutton   Brady  sutton@gmail.com   Scarlet  Sutton Brady
1     Kat  Edison     kat@gmail.com   Scarlet    Kat Edison
2    Jane   Sloan    jane@gmail.com    Incite    Jane Sloan